Term4/teorver/lectures/1.tex
% Created 2021-02-13 Sat 16:01
% Intended LaTeX compiler: pdflatex
\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}

 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\theoremstyle{plain}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{task}{Задача}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 1}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Статистическая вероятность}
\label{sec:org4bbf610}
\(n\) --- чсло экспериментов \\
\(n_A\) --- число выполнения события \(A\)
\begin{defintion}
Отношение \(\frac{n_A}{n}\) --- частота события \(A\) \\
\(P(A) \approx \frac{n_A}{n},\ n\to+\infty\)
\end{defintion}
\subsection{Пространство элементарных исходов. Случайные событи}
\label{sec:org6935f2d}
\begin{definition}
\textbf{Пространстов элементарных исходов} называется множество
содержащее все возможные результаты данного эксперимента из которых при
испытании происходит ровно один. Элементы этого множества называются \textbf{элементарными исходами}
\end{definition}
\begin{symb}
\-
\begin{itemize}
\item Пространство элементарных исходов --- \(\Omega\)
\item Элементарный исход \(w \in \Omega\)
\end{itemize}
\end{symb}
\begin{definition}
\textbf{Случайными событиями} называются подмножества \(A \subset \Omega\). Событие \(A\) \textbf{наступило} если в ходе эксперимента
произошел один из элементарных исходов \(w \in A\). \(w\) --- благоприятный к \(A\)
\end{definition}
\begin{examp}
Бросаем один раз монету. \(\Omega = \{H, T\}\). \\
\color{gray}
\(H\) --- Head(орел), \(T\) --- Tail(решка)
\end{examp}
\begin{examp}
Бросаем кубик. \(\Oemga = \{1, 2, 3, 4, 5, 6\}\) \\
Выпало четное число очков. \(A = \{2, 4, 6\}\)
\end{examp}
\begin{examp}
Монета бросается дважды
\begin{itemize}
\item Учитываем порядок. \(\Omega = \{HH, HT, TH, TT\}\)
\item Не учитываем порядок. \(\Omega = \{HH, HT, TT\}\)
\end{itemize}
\end{examp}
\begin{examp}
Бросается дважды кубик. Учитывем порядок. \\
Число очков кратно \(3\). \(A = \{ (1, 2), (2, 1), (1, 5), (5, 1), \dots \}\) 
\end{examp}
\begin{examp}
Монета бросается до выпадения герба. \(\Omega = \{ (H), (T, H), (T, T, H), \dots \}\) --- счетное число исходов
\end{examp}
\begin{examp}
Монета бросается на плоскость. \(\Omega = \{(x, y) \big\vert x, y \in \R\}\) --- нечетное число исходов
\end{examp}

\subsection{Операции над событиями}
\label{sec:orgec65635}
\begin{definition}
\(\Omega\) --- универсальное событие, достоверное, наступает всегда, т.к. содержит все элементарные исходы \\
\(\emptyset\) --- невозможное событие, никогда не выполняется, т.к. не одержит элементарных исходов
\end{definition}
\begin{definition}
\textbf{Суммой событий} \(A + B\) называется событие \(A \cup B\) --- событие
 состоящее в том что произошло событие \(A\) или событие \(B\), т.е. хотя
 бы одно и них
\end{definition}
\begin{definition}
\textbf{Произведением} \(A \cdot B\) называется событие \(A \cap B\) --- событие состоящее в том что произошло событие \(A\) и событие \(B\), т.е. оба из них
\end{definition}
\begin{definition}
\textbf{Противоположным} к \(A\) называется событие \(\overline{A}\) --- состоящее в том событие \(A\) не произошло
\end{definition}
\begin{center}
\begin{tikzpicture}
\draw[pattern=north east lines, pattern color=red] (4, 2) rectangle (-4, -2);
\draw[fill=white] (-1, 0) circle[radius=1cm] node {$A$};
\node[below] at (0, -2) {$\overline{A}$};
\node[above right] at (4, 2) {$\Omega$};
\end{tikzpicture}
\end{center}
\begin{definition}
\textbf{Дополнение}
\end{definition}
\begin{definition}
События \(A\) и \(B\) называются \textbf{несовместными} если \(A\cdot B = \emptyset\), т.е. в ходе эксперимента может наступить только одно из них
\end{definition}
\begin{definition}
Событие \(A\) \textbf{влечет} событие \(B\), если \(A \subset B\)
\end{definition}
\begin{definition}
\(P(A) \le 1\) --- вероятность наступления события \(A\)
\end{definition}
\subsection{Классическое определение вероятности}
\label{sec:org0ab241a}
Пусть \(\Omega\) содержит конечное число исходов, при чем их можно считать равновозможным.
Тогда применимо классическое определение вероятности
\begin{definition}
Вероятность события \(A\) \(P(A) = \frac{|A|}{|\Omega|} = \frac{m}{n}\), где \(n\) --- число всех возможных элеметарных
исходов, \(m\) --- число элементарных исходов благоприятных событию \(A\). В частности, если \(|\Omega = n|\), а \(A\) --- элементарный исход, то \(P(A) = \frac{1}{n}\)
\end{definition}
\begin{remark}
Cвойства:
\begin{enumerate}
\item \(0 \le P(A) \le 1\)
\setcounter{enumi}{3}
\item Если события \(A\) и \(B\) несовместны то вероятность \(P(A + B) = P(A) + P(B)\)
\begin{proof}
\(] |A| = m_1, |B| = m_2, |A\cup B| = m_1 + m_2\) \\
\(P(A + B) = \frac{m_1 + m_2}{n} = \frac{m_1}{n} + \frac{m_2}{n} = P(A) + P(B)\)
\end{proof}
\end{enumerate}
\end{remark}
\begin{examp}
Найти вероятность того, что при бросании кости выпадет четное число очков \\
\(\Omega = \{1, 2, 3, 4, 5, 6\},\ A = \{ 2, 4, 5\},\ P(A) = \frac{3}{6} = \frac{1}{2}\) 
\end{examp}
\begin{examp}
В ящике 3 белых и два черных шара. Вынули 3 шара, найти вероятность того что из них 2 белый и 1 черных
\begin{center}
\begin{tikzpicture}
\draw (4, 2) rectangle (-4, -2);
\draw (0, 2) -- (0, -2);
\node at (-2, 0) {$3\text{ б.}$};
\node at (2, 0) {$2\text{ ч.}$};
\draw[->] (-2, -1.5) -- (-2, -2.5) node[below] {$2$};
\draw[->] (2, -1.5) -- (2, -2.5) node[below] {$1$};
\draw[->] (-0.5, 2.5) node[left] {$5$} -> (4.5, 2.5) node[right] {$3$};
\end{tikzpicture}
\end{center}

\[ n = C^3_5 = 10 \]
\[ m = C^2_3\cdot C^1_2 = 6 \]
\[ P(A) = \frac{6}{10} \]
\end{examp}
\subsection{Геометрическое понятие вероятности}
\label{sec:orgaa1966d}
Пусть \(\Omega \subset \R^n\)  --- замкнутая ограниченая область \\
\(\mu(\Omega)\) --- конечная мера множества \(\Omega\) (например мера Римана, т.ее длина, площадь, объем) 
В эту область \emph{наугад} бросаем точку. Термин \emph{наугад} означает, что веротяность попадания в область \(A\)
зависит только от меры этой области, но не зависит от ее положения. Вероятность попадания в любые точки равновозможны.
Тогда применимо геометрическое определение вероятности.
\begin{definition}
\(P(A) = \frac{\mu(A)}{\mu(\Omega)}\), где \(\mu(\Omega)\) --- мера \(\Omega\), \(\mu(A)\) --- мера благоприятной области \(A\)
\end{definition}
\begin{remark}
Заметим что по этому определению, мера точки равна \(0\) и веротяность попадания в конкретную точку равна \(0\), хотя это событи не является невозможным.
\end{remark}
\begin{examp}
Игра. Монета диаметром 6 сантиметров бросается на пол, вымощеный
квадратной плиткой со стороной 20 сантиметров. Найти вероятнсть того
что монета целиком окажется на одной плитке
\begin{center}
\begin{tikzpicture}
\draw (4, 4) rectangle (-4, -4);
\draw (3, 3) rectangle (-3, -3);
\draw[<->] (-3, -1) -- (-4, -1);
\draw[<->] (-1, -3) -- (-1, -4);
\node at (0, 0) {$A$};
\node[left] at (-4, 0) {$20$};
\node[below] at (0, -4) {$20$};
\node[above] at (-3.5, -1) {$3$};
\node[right] at(-1, -3.5) {$3$};
\end{tikzpicture}
\end{center}

\[ S(\Omega) = 20^2 = 400 \]
\[ S(A) = 14^2 = 196 \]
\[ P(A) = \frac{196}{400} = 0.49 \]
\end{examp}
\begin{task}
Пол выложен ламинатом. На пол бросается игла длиной равной ширине
доски. Найти вероятность того что она пересечет стык
\end{task}
\begin{solution}
\(2l\) --- длина иглы, \(x\) --- расстояние от центра игла до ближайщего края, \(\varphi\) --- угол к ближайшему краю \\
Игла пересечет край если \(x \le |AB|\), \(|AB| = l\sin\varphi\) \\
Можно считать что положение от центра и угол, независимы друг от друга. \(x \in [0, l]. \varphi \in [0, \pi]\)
\begin{center}
\begin{tikzpicture}
\draw[->] (-0.5, 0) -- (5, 0) node[below] {$\varphi$};
\draw[->] (0, -0.5) -- (0, 4) node[left] {$x$};
\node[below left] at (0, 0) {$0$};
\draw[thick] (-0.1, 3) node[left] {$l$} -- ++ (0.2, 0);
\draw[thick] (4, -0.1) node[below] {$\pi$} -- ++ (0, 0.2);
\draw[thick] (2, -0.1) node[below] {$\frac{\pi}{2}$} -- ++ (0, 0.2);
\draw[dashed] (0, 3) -- (4, 3);
\draw[dashed] (4, 0) -- (4, 3);
\draw (0, 0) parabola bend (2, 3) (4, 0);
\node[above] at (2, 3) {$x = l\sin\varphi$};
\node at (2, 1.5) {$A$};
\end{tikzpicture}
\end{center}

\[ A: x \le l\sin\varphi \]
\[ S(\Omega) = \pi\cdot l \]
\[ S(A) = \int^\pi_0 l\sin\varphi d\varphi = 2l \]
\[ P(A) = \frac{S(A)}{S(\Omega)} = \frac{2l}{\pi l} = \frac{2}{\pi} \]
\end{solution}
\end{document}
